app/views/shared/_notifications.html.haml

SELECT "user_notifications".* FROM "user_notifications"  WHERE "user_notifications"."user_id" = $1 AND "user_notifications"."viewed" = 'f'
---
-#Add new attribute to User_notifications(where show_to_user:true)
-uns = current_user.user_notifications.where(viewed:false)