app/helpers/stats_helper.rb

  def get_used_land
    total = 0
    current_user.user_structures.each do |s|
---
SELECT "user_structures".* FROM "user_structures"  WHERE "user_structures"."user_id" = $1

  def get_page_variables
    #i made this to dramatically limit the amount of queries used to get these
    @num_town_centers = current_user.user_structures.where(structure_id:1).first.num
    @num_alters = current_user.user_structures.where(structure_id:2).first.num
    @num_barracks = current_user.user_structures.where(structure_id:3).first.num
    @num_banks = current_user.user_structures.where(structure_id:4).first.num
    @num_mana_core = current_user.user_structures.where(structure_id:5).first.num
---
SELECT  "user_structures".* FROM "user_structures"  WHERE "user_structures"."user_id" = $1 AND "user_structures"."structure_id" = 1  ORDER BY "user_structures"."id" ASC LIMIT 1

  def get_unit_user_population(ua)
    current_user.armies.where(user_armies:{army_id:ua.army_id}).first.population
---
SELECT "user_armies".* FROM "user_armies"  WHERE "user_armies"."user_id" = $1

  def get_unit_user_gold_cost
    userarmies = UserArmy.joins(:army).select("armies.population", "armies.gold_upkeep", "armies.mana_upkeep", :number_owned).where(user_id:current_user.id)
    i = 0
    userarmies.each do |userarmy|
---
SELECT  "armies".* FROM "armies" INNER JOIN "user_armies" ON "armies"."id" = "user_armies"."army_id" WHERE "user_armies"."user_id" = $1 AND "user_armies"."army_id" = 4  ORDER BY "armies"."id" ASC LIMIT 1