app/models/user.rb

SELECT  "roles".* FROM "roles" INNER JOIN "roles_users" ON "roles"."id" = "roles_users"."role_id" WHERE "roles_users"."user_id" = $1 AND "roles"."name" = 'admin' LIMIT 1
---
  def role?(role)
    return !!self.roles.find_by_name(role.to_s)